<<<<<<< HEAD
# 가장 오래 걸리는 스도쿠

print("8 0 0 0 0 0 0 0 0")
print("0 0 3 6 0 0 0 0 0")
print("0 7 0 0 9 0 2 0 0")
print("0 5 0 0 0 7 0 0 0")
print("0 0 0 0 4 0 7 0 0")
print("0 0 0 1 0 0 0 3 0")
print("0 0 1 0 0 0 0 0 8")
print("0 0 8 5 0 0 0 1 0")
=======
# 가장 오래 걸리는 스도쿠

print("8 0 0 0 0 0 0 0 0")
print("0 0 3 6 0 0 0 0 0")
print("0 7 0 0 9 0 2 0 0")
print("0 5 0 0 0 7 0 0 0")
print("0 0 0 0 4 0 7 0 0")
print("0 0 0 1 0 0 0 3 0")
print("0 0 1 0 0 0 0 0 8")
print("0 0 8 5 0 0 0 1 0")
>>>>>>> e238a4b4840a248e25507837388f6aee8e657899
print("0 9 0 0 0 0 4 0 0")